import random
print('โปรแกรมเป่ายิงฉุบ')
while True:
    a = random.choice(["ค้อน","กรรไกร","กระดาษ"])
    print(a)
    print('เลือก ค้อน กรรไกร กระดาษ')
    t = str(input("คุณเลือก : "))
    if t == a:
        print("ผลลัพธ์คือ เสมอ")
        print('-------------------------------')
    elif a == "กรรไกร" and t == "ค้อน" :
        print("ผลลัพธ์คือ ชนะ")
        print('-------------------------------')
    elif a == "ค้อน" and t == "กระดาษ" :
        print("ผลลัพธ์คือ ชนะ")
        print('-------------------------------')
    elif a == "กระดาษ" and t == "กรรไกร" :
        print("ผลลัพธ์คือ ชนะ")
        print('-------------------------------')
    else : 
        print("ผลลัพธ์คือ แพ้")
        print('-------------------------------')